# using pandas

In [1]:
import pandas as pd

In [5]:
df=pd.read_csv('d1input.csv',header=None)

In [6]:
df.head()

               0
0  88159   51481
1  66127   31794
2  71500   84893
3  59372   58807
4  97356   27409

In [13]:
type(df.iloc[0])

pandas.core.series.Series

In [17]:
new=df[0].str.split(" ", n=1, expand=True)

In [38]:
new.columns=['c1','c2']

In [41]:
new.head()

      c1       c2
0  88159    51481
1  66127    31794
2  71500    84893
3  59372    58807
4  97356    27409

In [44]:
new[['c1']]

        c1
0    88159
1    66127
2    71500
3    59372
4    97356
..     ...
995  38711
996  90949
997  82510
998  21910
999  38235

[1000 rows x 1 columns]

In [54]:
new=new.astype(float)

In [56]:
new.dtypes

c1    float64
c2    float64
dtype: object

In [57]:
trial=new.sort_values(by='c1',ascending=True)

In [58]:
trial

          c1       c2
60   10153.0  73124.0
687  10262.0  51481.0
216  10396.0  96314.0
49   10498.0  28807.0
709  10669.0  29862.0
..       ...      ...
921  99416.0  30124.0
227  99523.0  50581.0
276  99724.0  69088.0
140  99750.0  42777.0
582  99768.0  43470.0

[1000 rows x 2 columns]

In [63]:
l1=new[['c1']].sort_values(by='c1',ascending=True)
l1

          c1
60   10153.0
687  10262.0
216  10396.0
49   10498.0
709  10669.0
..       ...
921  99416.0
227  99523.0
276  99724.0
140  99750.0
582  99768.0

[1000 rows x 1 columns]

In [70]:
l1=l1['c1'].to_list()

In [86]:
l1=np.array(l1)

In [64]:
l2=new[['c2']].sort_values(by='c2',ascending=True)
l2

          c2
28   10159.0
437  10270.0
82   10520.0
267  11160.0
906  11212.0
..       ...
753  98652.0
621  99077.0
735  99189.0
786  99346.0
833  99616.0

[1000 rows x 1 columns]

In [71]:
l2=l2['c2'].to_list()

In [88]:
l2=np.array(l2)

In [91]:
sum(abs(l1-l2))

1579939.0

# using np to read csv instead of pandas

In [7]:
import numpy as np

In [9]:
data = np.loadtxt('d1input.csv')

In [74]:
type(data)

numpy.ndarray

In [11]:
data[1][0]

66127.0

1st column 
data[:,0]
2nd column
data[:,1]
rmr to sort

In [95]:
list1=(np.sort(data[:,0]))

In [96]:
list2=(np.sort(data[:,1]))

In [97]:
sum(abs(list1-list2))

1579939.0

# TASK 2 of day 1

Calculate a total similarity score

## using pandas df

link : https://adventofcode.com/2024/day/1#part2

set up and loading data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('d1input.csv',header=None)

In [3]:
df.head()

               0
0  88159   51481
1  66127   31794
2  71500   84893
3  59372   58807
4  97356   27409

In [4]:
new=df[0].str.split(" ", n=1, expand=True)

In [5]:
new.columns=['c1','c2']

In [19]:
new=new.astype(float)

In [20]:
new.head()

        c1       c2
0  88159.0  51481.0
1  66127.0  31794.0
2  71500.0  84893.0
3  59372.0  58807.0
4  97356.0  27409.0

for loop the whole list to get similarity score

In [9]:
traildata={'c1':[3,4,2,1,3,3],'c2':[4,3,5,3,9,3]}
trialdf=pd.DataFrame(traildata)
trialdf

   c1  c2
0   3   4
1   4   3
2   2   5
3   1   3
4   3   9
5   3   3

In [16]:
similarity_score=0
for i in trialdf['c1']:
    for j in trialdf['c2']:
        if i==j:
            similarity_score=similarity_score+i
print(similarity_score)

31

working on real dataframe

In [23]:
similarity_score=0
matchedid=0
for i in new['c1']:
    for j in new['c2']:
        if i==j:
            similarity_score=similarity_score+i
            if matchedid != i:
                print(i)
                matchedid=i

print(similarity_score)

28807.0
12446.0
41572.0
60158.0
82862.0
91399.0
79880.0
63653.0
77305.0
21742.0
64123.0
58807.0
51481.0
60615.0
50581.0
69088.0
94484.0
68978.0
85693.0
29057.0
90912.0
47024.0
29845.0
68926.0
89651.0
81626.0
61602.0
37490.0
55130.0
30124.0
40284.0
58940.0
65493.0
30263.0
20351745.0

In [18]:
new.dtypes

c1    object
c2    object
dtype: object

## using numpy

In [ ]:
import numpy as np
data = np.loadtxt('d1input.csv')
type(data)